cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

tap "1password/tap"
tap "github/gh"
tap "hashicorp/tap"

brew "gh"
brew "git"
brew "mas"
brew "node"
brew "nvm"
brew "shellcheck"
brew "starship"
brew "vim"
brew "wget"
brew "zsh"

# gnu stuff
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"

cask "1password"
cask "1password/tap/1password-cli"
cask "alfred"
cask "docker"
cask "docker-compose"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keybase"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "raycast"
cask "setapp"
cask "sublime-text"
cask "tinkerwell"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

# MacApp Store Apps
mas "Xcode", id: 497799835
mas "1Password for Safari", id: 1569813296
